; domain
(define (domain default)
  (:requirements :strips :adl :typing)  ; Domain capabilities.
  (:types
    agent workstation warehouse box supply - locatable  ; Object supply_types.
    location supply_type carrier - object
    capacity - object
  )
  (:predicates
    (adjacent ?l1 ?l2 - location)       ; Two locations are adjacent.
    (at ?o - locatable ?l - location)  ; An object is at a specific location.
    (empty ?b - box)   ; A box is empty.
    (free_arms ?a - agent) ; An agent has free arms (not carrying a box).
    (available ?b - box)
    (contains ?b - box ?s - supply) ; A box contains a specific supply.
    (is ?s - supply ?t -  supply_type) ; A supply is of a specific supply_type.
    (has ?ws - workstation ?t - supply_type) ; A workstation requires a supply of a specific supply_type.
    (loaded_to ?s - supply ?ws - workstation) ; A supply has been loaded onto a workstation.
    (attached ?c - carrier ?a - agent) ; A carrier is attached to an agent.
    (on ?c - carrier ?b - box) ; A box is on a carrier.
      ;; capacity
    (carrier_capacity ?c - carrier ?cap - capacity)
    (predecessor ?cap0 - capacity ?cap1 - capacity)
  )

  ;; Action definitions
  (:action move
    :parameters (?a - agent ?from ?to - location)
    :precondition (and 
      (adjacent ?from ?to)  ; The agent must move between adjacent locations.
      (at ?a ?from)  ; The agent must be at the starting location.
    )
    :effect (and 
      (at ?a ?to)  ; The agent is now at the destination location.
      (not (at ?a ?from))  ; The agent is no longer at the starting location.
    )
  )


  (:action load_box
    :parameters (?a - agent ?c - carrier ?b - box ?l - location ?c0 - capacity ?c1 - capacity)
    :precondition (and 
      (at ?b ?l)  ; The box must be at the agent's location.
      (at ?a ?l)  ; The agent must be at the location.
      (attached ?c ?a)  ; The carrier must be attached to the agent.
      (free_arms ?a)  ; The agent must have free arms.
      (available ?b)  ; The box must be available.
      (predecessor ?c0 ?c1)
      (carrier_capacity ?c ?c1)
    )
    :effect (and 
      (on ?c ?b)  ; The box is now on the carrier.
      (not (at ?b ?l))  ; The box is no longer at the location.
      (not (available ?b))  ; The box is no longer available to be carried by an agent.
      (carrier_capacity ?c ?c0)
      (not (carrier_capacity ?c ?c1))    
    )
  )

  (:action leave_box
    :parameters (?a - agent ?c - carrier ?b - box ?l - location ?wh - warehouse ?c0 - capacity ?c1 - capacity)
    :precondition (and 
      (at ?a ?l)  ; The agent must be at the location.
      (at ?wh ?l)  ; The warehouse must be at the location.
      (attached ?c ?a)  ; The carrier must be attached to the agent.
      (on ?c ?b)  ; The box must be on the carrier.
      (free_arms ?a)  ; The agent must have free arms.
      (predecessor ?c0 ?c1)
      (carrier_capacity ?c ?c0)
    )
    :effect (and 
      (not (on ?c ?b))  ; The box is no longer on the carrier.
      (at ?b ?l)  ; The box is now at the location.
      (available ?b)  ; The box is now available to be carried by an agent.
      (carrier_capacity ?c ?c1)
      (not (carrier_capacity ?c ?c0))    
    )
  )

  (:action fill_box
    :parameters (?a - agent ?b - box ?c - carrier ?s - supply ?l - location)
    :precondition (and 
      (at ?a ?l)  ; The agent must be at the location.
      (at ?s ?l)  ; The supply must be at the location.
      (empty ?b)  ; The box must be empty.
      (on ?c ?b)
      (attached ?c ?a)  ; The carrier must be attached to the agent.
    )
    :effect (and 
      (not (empty ?b))  ; The box is no longer empty.
      (contains ?b ?s)  ; The box now contains the supply.
      (not (at ?s ?l))  ; The supply is no longer at the location.
    )
  )
  
  (:action deliver_supply_to_workstation
    :parameters (?a - agent ?ws - workstation ?b - box ?s - supply ?l - location ?t - supply_type ?c - carrier)
    :precondition (and 
      (at ?a ?l)  ; The agent must be at the workstation's location.
      (at ?ws ?l)  ; The workstation must be at the location.
      (contains ?b ?s)  ; The box must contain the supply.
      (on ?c ?b)  ; The box must be on the carrier.
      (is ?s ?t)  ; The supply must be of the required supply_type.
      (attached ?c ?a)  ; The carrier must be attached to the agent.
    )
    :effect (and 
      (loaded_to ?s ?ws)  ; The supply is now loaded to the workstation.
      (not (contains ?b ?s))  ; The box no longer contains the supply.
      (empty ?b)  ; The box is now empty.
      (has ?ws ?t)  ; The workstation now has the required supply supply_type.
    )
  )
)

; problem
;; problem file: problem_1.pddl
(define (problem default)
  (:domain default)
  (:objects l1_4 l2_0 l4_0 l1_3 l1_2 l3_2 l2_2 l4_2 l3_0 l0_3 l4_4 l1_1 l2_3 l0_4 l1_0 l0_2 l3_3 l4_3 l2_4 l4_1 l0_1 l0_0 l3_1 l2_1 l3_4 - location agent_2 agent_1 agent_0 - agent supply_3 supply_9 supply_0 supply_11 supply_1 supply_8 supply_7 supply_6 supply_4 supply_2 supply_10 supply_5 - supply box_6 box_0 box_4 box_5 box_1 box_7 box_2 box_9 box_8 box_3 - box workstation_2 workstation_0 workstation_1 - workstation warehouse_0 - warehouse carrier_1 carrier_2 carrier_0 - carrier tool valve gear bolt - supply_type capacity_4 capacity_5 capacity_0 capacity_1 capacity_2 capacity_3 - capacity )
  (:init (at box_2 l0_2) (at box_5 l0_2) (at supply_2 l0_2) (adjacent l1_4 l2_4) (empty box_3) (adjacent l2_1 l2_2) (adjacent l3_1 l3_0) (is supply_1 valve) (attached carrier_0 agent_0) (adjacent l0_3 l1_3) (adjacent l2_0 l2_1) (adjacent l4_2 l3_2) (at warehouse_0 l0_2) (adjacent l0_0 l0_1) (available box_5) (carrier_capacity carrier_2 capacity_3) (adjacent l2_2 l2_1) (at workstation_1 l3_4) (available box_8) (adjacent l3_3 l3_4) (at supply_7 l0_2) (adjacent l4_3 l3_3) (adjacent l1_3 l0_3) (is supply_2 valve) (adjacent l1_2 l0_2) (is supply_6 tool) (adjacent l2_4 l3_4) (adjacent l4_0 l4_1) (empty box_9) (at agent_0 l0_2) (adjacent l2_4 l2_3) (adjacent l3_3 l2_3) (adjacent l4_3 l4_4) (adjacent l0_3 l0_4) (adjacent l4_3 l4_2) (adjacent l4_0 l3_0) (at box_0 l0_2) (is supply_7 tool) (at supply_4 l0_2) (adjacent l1_0 l2_0) (adjacent l1_3 l2_3) (adjacent l2_3 l2_2) (available box_1) (adjacent l3_3 l3_2) (at supply_1 l0_2) (adjacent l4_1 l3_1) (loaded_to supply_6 workstation_2) (empty box_7) (adjacent l3_3 l4_3) (adjacent l0_2 l0_3) (empty box_6) (available box_0) (adjacent l1_1 l1_2) (empty box_2) (at box_8 l0_2) (adjacent l1_2 l1_1) (is supply_11 gear) (empty box_0) (at workstation_0 l2_2) (available box_9) (adjacent l0_4 l0_3) (adjacent l1_1 l1_0) (adjacent l3_1 l2_1) (adjacent l3_2 l3_1) (adjacent l0_1 l0_0) (adjacent l4_1 l4_2) (adjacent l2_0 l3_0) (is supply_5 bolt) (adjacent l2_4 l1_4) (is supply_8 tool) (empty box_5) (is supply_9 gear) (at supply_11 l0_2) (adjacent l0_3 l0_2) (loaded_to supply_3 workstation_2) (is supply_0 valve) (adjacent l1_3 l1_4) (adjacent l2_1 l3_1) (adjacent l3_2 l3_3) (available box_2) (loaded_to supply_2 workstation_0) (adjacent l2_3 l1_3) (free_arms agent_2) (at supply_0 l0_2) (loaded_to supply_0 workstation_2) (predecessor capacity_0 capacity_1) (predecessor capacity_2 capacity_3) (adjacent l3_4 l3_3) (empty box_8) (available box_4) (adjacent l0_1 l1_1) (adjacent l2_3 l3_3) (at box_9 l0_2) (adjacent l4_4 l3_4) (adjacent l3_1 l4_1) (adjacent l1_1 l2_1) (adjacent l0_4 l1_4) (at workstation_2 l3_1) (at box_6 l0_2) (adjacent l2_2 l2_3) (free_arms agent_0) (at box_4 l0_2) (adjacent l3_4 l2_4) (adjacent l3_2 l2_2) (adjacent l2_3 l2_4) (attached carrier_2 agent_2) (adjacent l1_3 l1_2) (adjacent l2_2 l1_2) (empty box_4) (adjacent l3_2 l4_2) (predecessor capacity_3 capacity_4) (adjacent l0_2 l1_2) (adjacent l1_0 l1_1) (carrier_capacity carrier_0 capacity_3) (predecessor capacity_4 capacity_5) (adjacent l1_2 l1_3) (at supply_5 l0_2) (at supply_8 l0_2) (adjacent l3_0 l2_0) (at box_7 l0_2) (adjacent l0_0 l1_0) (carrier_capacity carrier_1 capacity_5) (empty box_1) (adjacent l2_2 l3_2) (adjacent l1_4 l0_4) (adjacent l4_1 l4_0) (adjacent l0_2 l0_1) (is supply_4 bolt) (adjacent l4_2 l4_1) (adjacent l4_2 l4_3) (adjacent l2_1 l1_1) (at agent_2 l0_2) (at supply_9 l0_2) (available box_6) (adjacent l1_4 l1_3) (is supply_3 bolt) (at supply_6 l0_2) (available box_7) (at supply_10 l0_2) (adjacent l2_0 l1_0) (free_arms agent_1) (adjacent l2_1 l2_0) (adjacent l1_0 l0_0) (is supply_10 gear) (adjacent l1_2 l2_2) (adjacent l3_0 l4_0) (loaded_to supply_7 workstation_1) (loaded_to supply_11 workstation_0) (adjacent l4_4 l4_3) (adjacent l3_4 l4_4) (adjacent l3_1 l3_2) (predecessor capacity_1 capacity_2) (available box_3) (at agent_1 l0_2) (attached carrier_1 agent_1) (at supply_3 l0_2) (at box_1 l0_2) (adjacent l3_0 l3_1) (adjacent l0_1 l0_2) (at box_3 l0_2) (adjacent l1_1 l0_1))
  (:goal (and (has workstation_0 bolt) (has workstation_0 tool) (has workstation_2 gear) (has workstation_1 valve) (has workstation_1 bolt) (has workstation_1 gear)))
)

; plan
1. (load_box agent_0 carrier_0 box_3 l0_2 capacity_2 capacity_3)
   deleted: (at box_3 l0_2) (available box_3) (carrier_capacity carrier_0 capacity_3)
   added: (on carrier_0 box_3) (carrier_capacity carrier_0 capacity_2)
   goals met: 0 of 6
2. (fill_box agent_0 box_3 carrier_0 supply_6 l0_2)
   deleted: (empty box_3) (at supply_6 l0_2)
   added: (contains box_3 supply_6)
   goals met: 0 of 6
3. (load_box agent_0 carrier_0 box_8 l0_2 capacity_1 capacity_2)
   deleted: (at box_8 l0_2) (available box_8) (carrier_capacity carrier_0 capacity_2)
   added: (on carrier_0 box_8) (carrier_capacity carrier_0 capacity_1)
   goals met: 0 of 6
4. (fill_box agent_0 box_8 carrier_0 supply_1 l0_2)
   deleted: (empty box_8) (at supply_1 l0_2)
   added: (contains box_8 supply_1)
   goals met: 0 of 6
5. (load_box agent_0 carrier_0 box_9 l0_2 capacity_0 capacity_1)
   deleted: (at box_9 l0_2) (available box_9) (carrier_capacity carrier_0 capacity_1)
   added: (on carrier_0 box_9) (carrier_capacity carrier_0 capacity_0)
   goals met: 0 of 6
6. (fill_box agent_0 box_9 carrier_0 supply_5 l0_2)
   deleted: (empty box_9) (at supply_5 l0_2)
   added: (contains box_9 supply_5)
   goals met: 0 of 6
7. (move agent_0 l0_2 l1_2)
   deleted: (at agent_0 l0_2)
   added: (at agent_0 l1_2)
   goals met: 0 of 6
8. (move agent_0 l1_2 l2_2)
   deleted: (at agent_0 l1_2)
   added: (at agent_0 l2_2)
   goals met: 0 of 6
9. (deliver_supply_to_workstation agent_0 workstation_0 box_3 supply_6 l2_2 tool carrier_0)
   deleted: (contains box_3 supply_6)
   added: (loaded_to supply_6 workstation_0) (empty box_3) (has workstation_0 tool)
   goals met: 1 of 6
10. (move agent_0 l2_2 l3_2)
   deleted: (at agent_0 l2_2)
   added: (at agent_0 l3_2)
   goals met: 1 of 6
11. (move agent_0 l3_2 l3_3)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_3)
   goals met: 1 of 6
12. (load_box agent_2 carrier_2 box_2 l0_2 capacity_2 capacity_3)
   deleted: (at box_2 l0_2) (available box_2) (carrier_capacity carrier_2 capacity_3)
   added: (on carrier_2 box_2) (carrier_capacity carrier_2 capacity_2)
   goals met: 1 of 6
13. (fill_box agent_2 box_2 carrier_2 supply_11 l0_2)
   deleted: (empty box_2) (at supply_11 l0_2)
   added: (contains box_2 supply_11)
   goals met: 1 of 6
14. (move agent_2 l0_2 l1_2)
   deleted: (at agent_2 l0_2)
   added: (at agent_2 l1_2)
   goals met: 1 of 6
15. (move agent_2 l1_2 l2_2)
   deleted: (at agent_2 l1_2)
   added: (at agent_2 l2_2)
   goals met: 1 of 6
16. (move agent_2 l2_2 l3_2)
   deleted: (at agent_2 l2_2)
   added: (at agent_2 l3_2)
   goals met: 1 of 6
17. (move agent_0 l3_3 l3_4)
   deleted: (at agent_0 l3_3)
   added: (at agent_0 l3_4)
   goals met: 1 of 6
18. (move agent_1 l0_2 l1_2)
   deleted: (at agent_1 l0_2)
   added: (at agent_1 l1_2)
   goals met: 1 of 6
19. (deliver_supply_to_workstation agent_0 workstation_1 box_8 supply_1 l3_4 valve carrier_0)
   deleted: (contains box_8 supply_1)
   added: (loaded_to supply_1 workstation_1) (empty box_8) (has workstation_1 valve)
   goals met: 2 of 6
20. (deliver_supply_to_workstation agent_0 workstation_1 box_9 supply_5 l3_4 bolt carrier_0)
   deleted: (contains box_9 supply_5)
   added: (loaded_to supply_5 workstation_1) (empty box_9) (has workstation_1 bolt)
   goals met: 3 of 6
21. (move agent_1 l1_2 l0_2)
   deleted: (at agent_1 l1_2)
   added: (at agent_1 l0_2)
   goals met: 3 of 6
22. (load_box agent_1 carrier_1 box_7 l0_2 capacity_4 capacity_5)
   deleted: (at box_7 l0_2) (available box_7) (carrier_capacity carrier_1 capacity_5)
   added: (on carrier_1 box_7) (carrier_capacity carrier_1 capacity_4)
   goals met: 3 of 6
23. (fill_box agent_1 box_7 carrier_1 supply_4 l0_2)
   deleted: (empty box_7) (at supply_4 l0_2)
   added: (contains box_7 supply_4)
   goals met: 3 of 6
24. (move agent_1 l0_2 l1_2)
   deleted: (at agent_1 l0_2)
   added: (at agent_1 l1_2)
   goals met: 3 of 6
25. (move agent_1 l1_2 l2_2)
   deleted: (at agent_1 l1_2)
   added: (at agent_1 l2_2)
   goals met: 3 of 6
26. (deliver_supply_to_workstation agent_1 workstation_0 box_7 supply_4 l2_2 bolt carrier_1)
   deleted: (contains box_7 supply_4)
   added: (loaded_to supply_4 workstation_0) (empty box_7) (has workstation_0 bolt)
   goals met: 4 of 6
27. (move agent_2 l3_2 l3_3)
   deleted: (at agent_2 l3_2)
   added: (at agent_2 l3_3)
   goals met: 4 of 6
28. (move agent_2 l3_3 l3_4)
   deleted: (at agent_2 l3_3)
   added: (at agent_2 l3_4)
   goals met: 4 of 6
29. (deliver_supply_to_workstation agent_2 workstation_1 box_2 supply_11 l3_4 gear carrier_2)
   deleted: (contains box_2 supply_11)
   added: (loaded_to supply_11 workstation_1) (empty box_2) (has workstation_1 gear)
   goals met: 5 of 6
30. (move agent_1 l2_2 l1_2)
   deleted: (at agent_1 l2_2)
   added: (at agent_1 l1_2)
   goals met: 5 of 6
31. (move agent_1 l1_2 l0_2)
   deleted: (at agent_1 l1_2)
   added: (at agent_1 l0_2)
   goals met: 5 of 6
32. (fill_box agent_1 box_7 carrier_1 supply_9 l0_2)
   deleted: (empty box_7) (at supply_9 l0_2)
   added: (contains box_7 supply_9)
   goals met: 5 of 6
33. (move agent_1 l0_2 l1_2)
   deleted: (at agent_1 l0_2)
   added: (at agent_1 l1_2)
   goals met: 5 of 6
34. (move agent_1 l1_2 l2_2)
   deleted: (at agent_1 l1_2)
   added: (at agent_1 l2_2)
   goals met: 5 of 6
35. (move agent_1 l2_2 l3_2)
   deleted: (at agent_1 l2_2)
   added: (at agent_1 l3_2)
   goals met: 5 of 6
36. (move agent_1 l3_2 l3_1)
   deleted: (at agent_1 l3_2)
   added: (at agent_1 l3_1)
   goals met: 5 of 6
37. (deliver_supply_to_workstation agent_1 workstation_2 box_7 supply_9 l3_1 gear carrier_1)
   deleted: (contains box_7 supply_9)
   added: (loaded_to supply_9 workstation_2) (empty box_7) (has workstation_2 gear)
   goals met: 6 of 6
